//
// Created by Георгий Круглов on 14.05.2021.
//

#ifndef GENETICCUBE_CUBEINDICESDATA_HPP
#define GENETICCUBE_CUBEINDICESDATA_HPP

#include <vector>

namespace Logic::CubeIndicesData {
    namespace Rotation {
        //Индексы сторон после поворота: subFaceletsRotation[_][i] - сторона на i-той позиции
        static const std::vector<std::vector<int>> faceletRotation = {
                {6, 3, 0, 7, 4, 1, 8, 5, 2},
                {2, 5, 8, 1, 4, 7, 0, 3, 6},
                {8, 7, 6, 5, 4, 3, 2, 1, 0}
        };

        //Грани с которых начинается поворот смежных сторон
        static const std::vector<int> begins = {5, 5, 5, 4, 1, 3, 1, 1, 5};
        //Грани в порядке обхода для перемещения при вращении
        static const std::vector<std::vector<std::vector<int>>> subFaces = {
                {
                        {1, 4, 3, 5},
                        {3, 4, 1, 5}
                },
                {
                        {2, 4, 0, 5},
                        {0, 4, 2, 5}
                },
                {
                        {3, 4, 1, 5},
                        {1, 4, 3, 5}
                },
                {
                        {2, 5, 0, 4},
                        {0, 5, 2, 4}
                },
                {
                        {2, 3, 0, 1},
                        {0, 3, 2, 1}
                },
                {
                        {2, 1, 0, 3},
                        {0, 1, 2, 3}
                },
                {
                        {2, 3, 0, 1},
                        {0, 3, 2, 1}
                },
                {
                        {5, 3, 4, 1},
                        {4, 3, 5, 1}
                },
                {
                        {2, 4, 0, 5},
                        {0, 4, 2, 5}
                }
        };
        //Индексы соответствующих квадратов при вращении
        static const std::vector<std::vector<std::vector<int>>> subFaceletsRotation = {
                {
                        {},
                        {0, 1, 2},
                        {},
                        {0, 1, 2},
                        {0, 1, 2},
                        {0, 1, 2},
                },
                {
                        {8, 7, 6},
                        {},
                        {0, 1, 2},
                        {},
                        {2, 5, 8},
                        {6, 3, 0}
                },
                {
                        {},
                        {6, 7, 8},
                        {},
                        {6, 7, 8},
                        {6, 7, 8},
                        {6, 7, 8}
                },
                {
                        {0, 1, 2},
                        {},
                        {8, 7, 6},
                        {},
                        {6, 3, 0},
                        {2, 5, 8}
                },
                {
                        {0, 3, 6},
                        {0, 3, 6},
                        {0, 3, 6},
                        {8, 5, 2},
                        {},
                        {}
                },
                {
                        {2, 5, 8},
                        {2, 5, 8},
                        {2, 5, 8},
                        {6, 3, 0},
                        {},
                        {}
                },
                {
                        {1, 4, 7},
                        {1, 4, 7},
                        {1, 4, 7},
                        {7, 4, 1},
                        {},
                        {}
                },
                {
                        {},
                        {3, 4, 5},
                        {},
                        {3, 4, 5},
                        {3, 4, 5},
                        {3, 4, 5}
                },
                {
                        {3, 4, 5},
                        {},
                        {5, 4, 3},
                        {},
                        {7, 4, 1},
                        {1, 4, 7}
                }
        };
    }

    namespace Fitness {
        static const std::vector<std::vector<int>> barsBases = {
                {-1, 1,  -1, 1,  1,  1},
                {7,  -1, 1,  -1, 5,  3},
                {-1, 7,  -1, 7,  7,  7},
                {1,  -1, 7,  -1, 3,  5},
                {3,  3,  3,  5,  -1, -1},
                {5,  5,  5,  3,  -1, -1}
        };

        static const std::vector<std::vector<std::vector<int>>> pyramidBases = {
                {
                        {},
                        {0, 2},
                        {},
                        {0, 2},
                        {0, 2},
                        {0, 2}
                },
                {
                        {6, 8},
                        {},
                        {0, 2},
                        {},
                        {2, 8},
                        {0, 6}
                },
                {
                        {},
                        {6, 8},
                        {},
                        {6, 8},
                        {6, 8},
                        {6, 8}
                },
                {
                        {0, 2},
                        {},
                        {6, 8},
                        {},
                        {0, 6},
                        {2, 8}
                },
                {
                        {0, 6},
                        {0, 6},
                        {0, 6},
                        {2, 8},
                        {},
                        {}
                },
                {
                        {2, 8},
                        {2, 8},
                        {2, 8},
                        {0, 6},
                        {},
                        {}
                }
        };

        static const std::vector<std::vector<std::vector<int>>> bagEars = {
                {
                        {},
                        {3, 5},
                        {},
                        {3, 5},
                        {3, 5},
                        {3, 5}
                },
                {
                        {3, 5},
                        {},
                        {3, 5},
                        {},
                        {1, 7},
                        {1, 7}
                },
                {
                        {},
                        {3, 5},
                        {},
                        {3, 5},
                        {3, 5},
                        {3, 5}
                },
                {
                        {3, 5},
                        {},
                        {3, 5},
                        {},
                        {1, 7},
                        {1, 7}
                },
                {
                        {1, 7},
                        {1, 7},
                        {1, 7},
                        {1, 7},
                        {},
                        {}
                },
                {
                        {1, 7},
                        {1, 7},
                        {1, 7},
                        {1, 7},
                        {},
                        {}
                }
        };

        static const std::vector<std::vector<int>> sidesTops = {
                {-1, 7,  -1, 7,  7,  7},
                {1,  -1, 7,  -1, 3,  5},
                {-1, 1,  -1, 1,  1,  1},
                {7,  -1, 1,  -1, 5,  3},
                {5,  5,  5,  3,  -1, -1},
                {3,  3,  3,  5,  -1, -1}
        };

        static const std::vector<std::vector<std::vector<int>>> topCrossEars = {
                {
                        {},
                        {6, 8},
                        {0, 2, 6, 8},
                        {6, 8},
                        {6, 8},
                        {6, 8}
                },
                {
                        {0, 2},
                        {},
                        {6, 8},
                        {0, 2, 6, 8},
                        {0, 6},
                        {2, 8}
                },
                {
                        {0, 2, 6, 8},
                        {0, 2},
                        {},
                        {0, 2},
                        {0, 2},
                        {0, 2}
                },
                {
                        {6, 8},
                        {0, 2, 6, 8},
                        {0, 2},
                        {},
                        {2, 8},
                        {0, 6}
                },
                {
                        {2, 8},
                        {2, 8},
                        {2, 8},
                        {0, 6},
                        {},
                        {0, 2, 6, 8}
                },
                {
                        {0, 6},
                        {0, 6},
                        {0, 6},
                        {2, 8},
                        {0, 2, 6, 8},
                        {}
                }
        };
    }
};

#endif //GENETICCUBE_CUBEINDICESDATA_HPP
